# Известно два узла с IP-адресами 123.20.103.136 и 123.20.103.151 принадлежат разным сетям с одинаковой маской.
#
# Определите значение 4 байта маски в этих сетях.
from ipaddress import *


add1 = ip_address('123.20.103.136')
add2 = ip_address('123.20.103.151')
print(bin(int(add1)))
print(bin(int(add2)))
print(int('11110000', 2))
